/* No comment provided by engineer. */
"AB_PERMISSION_MISSING_ACTION" = "ให้เข้าถึง";

/* No comment provided by engineer. */
"AB_PERMISSION_MISSING_BODY" = "Forsta ต้องการเข้าถึงรายชื่อของคุณ เราจะไม่จัดเก็บรายชื่อของคุณไว้บนเซิร์ฟเวอร์ของเรา";

/* No comment provided by engineer. */
"AB_PERMISSION_MISSING_TITLE" = "ขออภัย!";

/* Action sheet item */
"ACCEPT_NEW_IDENTITY_ACTION" = "ยอมรับตัวเลขความปลอดภัยใหม่";

/* No comment provided by engineer. */
"ACTION_REQUIRED_TITLE" = "จำเป็นต้องดำเนินการ";

/* No comment provided by engineer. */
"ADDRESSBOOK_RESTRICTED_ALERT_BODY" = "Forsta ต้องการเข้าถึงรายชื่อของคุณ การเข้าถึงรายชื่อถูกจำกัด Forsta จะปิด คุณสามารถปิดใช้งานการจำกัดชั่วคราวเพื่อให้ Forsta เข้าถึงรายชื่อของคุณได้โดยไปที่แอป การตั้งค่า >> ทั่วไป >> การจำกัด >> รายชื่อ >> อนุญาตให้เปลี่ยน";

/* No comment provided by engineer. */
"ADDRESSBOOK_RESTRICTED_ALERT_BUTTON" = "ปิด";

/* No comment provided by engineer. */
"ANSWER_CALL_BUTTON_TITLE" = "รับสาย";

/* No comment provided by engineer. */
"APN_FETCHED_FAILED" = "ข้อความใหม่! เปิดแอปเพื่ออ่าน";

/* No comment provided by engineer. */
"APN_Message" = "ข้อความใหม่!";

/* No comment provided by engineer. */
"APN_MESSAGE_FROM" = "ข้อความจาก";

/* No comment provided by engineer. */
"APN_MESSAGE_IN_GROUP" = "ข้อความในกลุ่ม";

/* No comment provided by engineer. */
"APN_MESSAGE_IN_GROUP_DETAILED" = "%@ ในกลุ่ม %@: %@";

/* Pressing this button moves a thread from the inbox to the archive */
"ARCHIVE_ACTION" = "เก็บถาวร";

/* No comment provided by engineer. */
"ARCHIVE_NAV_BAR_TITLE" = "เก็บถาวร";

/* No comment provided by engineer. */
"ATTACHMENT" = "ไฟล์แนบ";

/* No comment provided by engineer. */
"ATTACHMENT_DOWNLOAD_FAILED" = "การดาวน์โหลดไฟล์แนบล้มเหลว แตะเพื่อลองใหม่";

/* No comment provided by engineer. */
"ATTACHMENT_DOWNLOADING" = "กำลังดาวน์โหลดไฟล์แนบ";

/* No comment provided by engineer. */
"ATTACHMENT_QUEUED" = "ไฟล์แนบถูกจัดคิวสำหรับดึงข้อมูล";

/* No comment provided by engineer. */
"AUDIO_PERMISSION_MESSAGE" = "Forsta ต้องการเข้าถึงไมโครโฟนของคุณเพื่อให้ทำงานได้ถูกต้อง คุณสามารถเรียกคืนสิทธิการเข้าถึงได้ในแอป การตั้งค่า >> ความเป็นส่วนตัว >> ไมโครโฟน >> Forsta";

/* No comment provided by engineer. */
"CALLBACK_BUTTON_TITLE" = "โทรกลับ";

/* No comment provided by engineer. */
"CHOOSE_MEDIA_BUTTON" = "เลือกจากคลัง...";

/* No comment provided by engineer. */
"CONFIRM_ACCOUNT_DESTRUCTION_TEXT" = "สิ่งนี้จะรีเซ็ตแอปพลิเคชันโดยลบข้อความของคุณและเลิกลงทะเบียนคุณกับเซิร์ฟเวอร์ แอปจะปิดหลังจากการลบข้อมูล";

/* No comment provided by engineer. */
"CONFIRM_ACCOUNT_DESTRUCTION_TITLE" = "คุณแน่ใจหรือไม่ว่าต้องการลบบัญชีของคุณ?";

/* Alert body */
"CONFIRM_LEAVE_GROUP_DESCRIPTION" = "คุณจะไม่สามารถส่งหรือรับข้อความในกลุ่มนี้ได้อีกต่อไป";

/* Alert title */
"CONFIRM_LEAVE_GROUP_TITLE" = "คุณต้องการออกแน่หรือไม่?";

/* Button text */
"CONFIRM_LINK_NEW_DEVICE_ACTION" = "เชื่อมโยงอุปกรณ์ใหม่";

/* No comment provided by engineer. */
"CONFIRMATION_TITLE" = "ยืนยัน";

/* No comment provided by engineer. */
"CONTACT_DETAIL_COMM_TYPE_INSECURE" = "หมายเลขที่ยังไม่ลงทะเบียน";

/* title for conversation settings screen */
"CONVERSATION_SETTINGS" = "ตั้งค่าการสนทนา";

/* ActionSheet title */
"CORRUPTED_SESSION_DESCRIPTION" = "Resetting your session will allow you to receive future messages from %@, but it will not recover any already corrupted messages.";

/* No comment provided by engineer. */
"COUNTRYCODE_SELECT_TITLE" = "เลือกรหัสประเทศ";

/* {{number of days}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 days}}'. See other *_TIME_AMOUNT strings */
"DAYS_TIME_AMOUNT" = "%u วัน";

/* No comment provided by engineer. */
"DELIVERED_MESSAGE_TEXT" = "ส่งแล้ว";

/* {{Short Date}} when device last communicated with Forsta Server. */
"DEVICE_LAST_ACTIVE_AT_LABEL" = "ใช้งานล่าสุด: %@";

/* {{Short Date}} when device was linked. */
"DEVICE_LINKED_AT_LABEL" = "เชื่อมโยงเมื่อ: %@";

/* Alert title that can occur when viewing device manager. */
"DEVICE_LIST_UPDATE_FAILED_TITLE" = "ไม่สามารถอัปเดตรายการอุปกรณ์";

/* table cell label in conversation settings */
"DISAPPEARING_MESSAGES" = "ข้อความหายตัว";

/* subheading in conversation settings */
"DISAPPEARING_MESSAGES_DESCRIPTION" = "เมื่อเปิดใช้งาน ข้อความที่ส่งและรับในการสนทนานี้จะหายไปหลังจากเห็นแล้ว";

/* Generic short text for button to dismiss a dialog */
"DISMISS_BUTTON_TEXT" = "บอกเลิก";

/* table cell label in conversation settings */
"EDIT_GROUP_ACTION" = "แก้ไขกลุ่ม";

/* Short name for edit menu item to save contents of media message. */
"EDIT_ITEM_SAVE_ACTION" = "บันทึก";

/* No comment provided by engineer. */
"EMPTY_ARCHIVE_FIRST_TEXT" = "แตะบนปุ่มเขียน";

/* No comment provided by engineer. */
"EMPTY_ARCHIVE_FIRST_TITLE" = "เริ่มการสนทนาแรกของคุณบน Forsta!";

/* No comment provided by engineer. */
"EMPTY_ARCHIVE_TEXT" = "คุณสามารถเก็บถาวรการสนทนาที่ไม่ได้ใช้งานได้ในภายหลังจากกล่องขาเข้าของคุณ";

/* No comment provided by engineer. */
"EMPTY_ARCHIVE_TITLE" = "ล้างการสนทนาของคุณ";

/* No comment provided by engineer. */
"EMPTY_CONTACTS_INVITE_BUTTON" = "เชิญชวนรายชื่อ";

/* No comment provided by engineer. */
"EMPTY_CONTACTS_LABEL_LINE1" = "ไม่มีใครในรายชื่อของคุณมี Forsta!";

/* No comment provided by engineer. */
"EMPTY_CONTACTS_LABEL_LINE2" = "ทำไมคุณไม่เชิญชวนใครสักคนล่ะ";

/* No comment provided by engineer. */
"EMPTY_INBOX_FIRST_TEXT" = "เคล็ดลับ: เพิ่มการสนทนาเป็นเตือนความจำ!";

/* No comment provided by engineer. */
"EMPTY_INBOX_FIRST_TITLE" = "เสร็จสิ้น";

/* No comment provided by engineer. */
"EMPTY_INBOX_TEXT" = "ว่างเปล่า";

/* No comment provided by engineer. */
"EMPTY_INBOX_TITLE" = "ว่างเปล่า";

/* No comment provided by engineer. */
"END_CALL_BAD_INTERACTION_WITH_SERVER" = "เซิร์ฟเวอร์ล้มเหลว!";

/* No comment provided by engineer. */
"END_CALL_BUTTON_TITLE" = "สิ้นสุด";

/* No comment provided by engineer. */
"END_CALL_HANDSHAKE_FAILED" = "Handshake ล้มเหลว!";

/* No comment provided by engineer. */
"END_CALL_HANGUP_LOCAL" = "คุณได้วางสาย";

/* No comment provided by engineer. */
"END_CALL_HANGUP_REMOTE" = "เขาได้วางสาย";

/* No comment provided by engineer. */
"END_CALL_LOGIN_FAILED" = "การเข้าสู่ระบบล้มเหลว!";

/* No comment provided by engineer. */
"END_CALL_MESSAGE_FROM_SERVER_PREFIX" = "ข้อความจากเซิร์ฟเวอร์: ";

/* No comment provided by engineer. */
"END_CALL_NO_SUCH_USER" = "หมายเลขไม่ได้ลงทะเบียนกับ Forsta หรือ RedPhone!";

/* No comment provided by engineer. */
"END_CALL_RECIPIENT_UNAVAILABLE" = "ผู้รับไม่พร้อมใช้งาน";

/* No comment provided by engineer. */
"END_CALL_REJECTED_LOCAL" = "คุณได้ปฏิเสธสาย";

/* No comment provided by engineer. */
"END_CALL_REJECTED_REMOTE" = "สายถูกปฏิเสธ";

/* No comment provided by engineer. */
"END_CALL_REPLACED_BY_NEXT" = "คุณได้ต่อสายอื่น";

/* No comment provided by engineer. */
"END_CALL_RESPONDER_IS_BUSY" = "ไม่ว่าง...";

/* No comment provided by engineer. */
"END_CALL_STALE_SESSION" = "ไม่ได้รับสาย";

/* No comment provided by engineer. */
"END_CALL_UNCATEGORIZED_FAILURE" = "ลูกข่ายล้มเหลว!";

/* Generic notice when message failed to send. */
"ERROR_DESCRIPTION_CLIENT_SENDING_FAILURE" = "ไม่สามารถส่งข้อความ";

/* Generic error used whenver Forsta can't contact the server */
"ERROR_DESCRIPTION_NO_INTERNET" = "Forsta ไม่สามารถเชื่อมต่ออินเทอร์เน็ต โปรดลองจากเครือข่าย WiFi อื่นหรือใช้ข้อมูลมือถือ";

/* Generic server error */
"ERROR_DESCRIPTION_SERVER_FAILURE" = "ข้อผิดพลาดเซิร์ฟเวอร์ โปรดลองอีกครั้งในภายหลัง";

/* Error message when attempting to send message */
"ERROR_DESCRIPTION_UNREGISTERED_RECIPIENT" = "ผู้รับไม่ได้เป็นผู้ใช้ Forsta อีกต่อไป";

/* No comment provided by engineer. */
"ERROR_MESSAGE_DUPLICATE_MESSAGE" = "ได้รับข้อความที่ซ้ำกัน";

/* No comment provided by engineer. */
"ERROR_MESSAGE_INVALID_KEY_EXCEPTION" = "กุญแจของผู้รับไม่ถูกต้อง";

/* No comment provided by engineer. */
"ERROR_MESSAGE_INVALID_MESSAGE" = "ได้รับข้อความที่เข้ารหัสไม่ดี แตะเพื่อรีเซ็ตวาระแบบปลอดภัยของคุณ";

/* No comment provided by engineer. */
"ERROR_MESSAGE_INVALID_VERSION" = "ได้รับข้อความที่เข้ากันไม่ได้กับรุ่นนี้";

/* No comment provided by engineer. */
"ERROR_MESSAGE_NO_SESSION" = "ไม่มีวาระที่ใช้งานได้สำหรับรายชื่อ";

/* No comment provided by engineer. */
"ERROR_MESSAGE_NON_BLOCKING_IDENTITY_CHANGE" = "Safety numbers changed.";

/* No comment provided by engineer. */
"ERROR_MESSAGE_UNKNOWN_ERROR" = "เกิดข้อผิดพลาดที่ไม่รู้จัก";

/* No comment provided by engineer. */
"ERROR_MESSAGE_WRONG_TRUSTED_IDENTITY_KEY" = "ตัวเลขความปลอดภัยถูกเปลี่ยน แตะเพื่อตรวจสอบ";

/* No comment provided by engineer. */
"ERROR_WAS_DETECTED_TITLE" = "แย่จัง!";

/* action sheet header when re-sending message which failed because of too many attempts */
"FAILED_SENDING_BECAUSE_RATE_LIMIT" = "Too many failures with this contact. Please try again shortly.";

/* action sheet header when re-sending message which failed because of untrusted identity keys */
"FAILED_SENDING_BECAUSE_UNTRUSTED_IDENTITY_KEY" = "คุณต้องยอมรับตัวเลขความปลอดภัยใหม่ของเขาก่อนที่คุณจะสามารถส่ง";

/* No comment provided by engineer. */
"FAILED_SENDING_TEXT" = "การส่งล้มเหลว แตะเพื่อลองใหม่";

/* alert title */
"FAILED_VERIFICATION_TITLE" = "ไม่สามารถตรวจสอบตัวเลขความปลอดภัย!";

/* No comment provided by engineer. */
"FINGERPRINT_SHRED_KEYMATERIAL_BUTTON" = "รีเซ็ตวาระนี้";

/* No comment provided by engineer. */
"GROUP_AVATAR_CHANGED" = "เปลี่ยนภาพประจำตัวแล้ว";

/* No comment provided by engineer. */
"GROUP_CREATED" = "สร้างกลุ่มแล้ว";

/* No comment provided by engineer. */
"GROUP_CREATING" = "กำลังสร้างกลุ่มใหม่";

/* No comment provided by engineer. */
"GROUP_CREATING_FAILED" = "การสร้างกลุ่มล้มเหลว";

/* Conversation settings table section title */
"GROUP_MANAGEMENT_SECTION" = "การจัดการกลุ่ม";

/* No comment provided by engineer. */
"GROUP_MEMBER_JOINED" = " %@ ได้เข้าร่วมกลุ่ม";

/* No comment provided by engineer. */
"GROUP_MEMBER_LEFT" = " %@ ได้ออกจากกลุ่ม";

/* header for table which lists the members of this group thread */
"GROUP_MEMBERS_HEADER" = "สมาชิกกลุ่ม";

/* No comment provided by engineer. */
"GROUP_REMOVING" = "กำลังออกจากกลุ่ม %@";

/* No comment provided by engineer. */
"GROUP_REMOVING_FAILED" = "ไม่สามารถออกจากกลุ่ม";

/* No comment provided by engineer. */
"GROUP_TITLE_CHANGED" = "หัวข้อตอนนี้เป็น '%@'";

/* No comment provided by engineer. */
"GROUP_UPDATED" = "อัปเดตกลุ่มแล้ว";

/* No comment provided by engineer. */
"GROUP_YOU_LEFT" = "คุณได้ออกจากกลุ่ม";

/* {{number of hours}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 hours}}'. See other *_TIME_AMOUNT strings */
"HOURS_TIME_AMOUNT" = "%u ชั่วโมง";

/* Call setup status label */
"IN_CALL_CONNECTING" = "กำลังเชื่อมต่อ...";

/* Call setup status label */
"IN_CALL_RINGING" = "กำลังส่งเสียง...";

/* Call setup status label */
"IN_CALL_SECURING" = "รับสายแล้ว กำลังทำให้ปลอดภัย...";

/* Call setup status label */
"IN_CALL_TALKING" = "ปลอดภัย ใช้งานอยู่";

/* Call setup status label */
"IN_CALL_TERMINATED" = "เสร็จสิ้น";

/* No comment provided by engineer. */
"INCOMING_CALL" = "สายโทรเข้า";

/* No comment provided by engineer. */
"INCOMING_CALL_FROM" = "สายโทรเข้าจาก %@";

/* Slider label embeds {{TIME_AMOUNT}}, e.g. '2 hours'. See *_TIME_AMOUNT strings for examples. */
"KEEP_MESSAGES_DURATION" = "ข้อความจะหายไปหลังจาก %@";

/* Slider label when disappearing messages is off */
"KEEP_MESSAGES_FOREVER" = "ข้อความจะไม่หายไป";

/* Confirmation button within contextual alert */
"LEAVE_BUTTON_TITLE" = "ออก";

/* table cell label in conversation settings */
"LEAVE_GROUP_ACTION" = "ออกจากกลุ่ม";

/* report an invalid linking code */
"LINK_DEVICE_INVALID_CODE_BODY" = "รหัส QR นี้ไม่ถูกต้อง ตรวจสอบให้แน่ใจว่าคุณกำลังสแกนรหัส QR ที่แสดงผลบนอุปกรณ์ที่คุณต้องการเชื่อมโยง";

/* report an invalid linking code */
"LINK_DEVICE_INVALID_CODE_TITLE" = "การเชื่อมโยงอุปกรณ์ล้มเหลว";

/* confirm the users intent to link a new device */
"LINK_DEVICE_PERMISSION_ALERT_BODY" = "อุปกรณ์นี้จะสามารถดูกลุ่มและรายชื่อของคุณ อ่านข้อความทั้งหมดของคุณ และส่งข้อความในชื่อของคุณ";

/* confirm the users intent to link a new device */
"LINK_DEVICE_PERMISSION_ALERT_TITLE" = "เชื่อมโยงอุปกรณ์นี้?";

/* attempt another linking */
"LINK_DEVICE_RESTART" = "ลองใหม่";

/* QR Scanning screen instructions, placed alongside a camera view for scanning QRCodes */
"LINK_DEVICE_SCANNING_INSTRUCTIONS" = "สแกนรหัส QR ที่แสดงผลบนอุปกรณ์เพื่อเชื่อมโยง";

/* Subheading for 'Link New Device' navigation */
"LINK_NEW_DEVICE_SUBTITLE" = "สแกนรหัส QR";

/* Navigation title when scanning QR code to add new device. */
"LINK_NEW_DEVICE_TITLE" = "เชื่อมโยงอุปกรณ์ใหม่";

/* Menu item and navbar title for the device manager */
"LINKED_DEVICES_TITLE" = "อุปกรณ์ที่เชื่อมโยง";

/* Alert Title */
"LINKING_DEVICE_FAILED_TITLE" = "การเชื่อมโยงอุปกรณ์ล้มเหลว";

/* table cell label in conversation settings */
"LIST_GROUP_MEMBERS_ACTION" = "รายชื่อสมาชิกกลุ่ม";

/* No comment provided by engineer. */
"LOADING_CONTACTS_LABEL_LINE1" = "กำลังโหลดรายชื่อของคุณ";

/* No comment provided by engineer. */
"LOADING_CONTACTS_LABEL_LINE2" = "อดใจรอ";

/* No comment provided by engineer. */
"LOGGING_SECTION" = "การบันทึก";

/* No comment provided by engineer. */
"ME_STRING" = "ฉัน";

/* No comment provided by engineer. */
"MESSAGE_COMPOSEVIEW_TITLE" = "ข้อความใหม่";

/* {{number of minutes}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 minutes}}'. See other *_TIME_AMOUNT strings */
"MINUTES_TIME_AMOUNT" = "%u นาที";

/* No comment provided by engineer. */
"MISSED_CALL" = "สายที่ไม่ได้รับ";

/* Alert body */
"MISSING_CAMERA_PERMISSION_MESSAGE" = "You previously declined to let Forsta access your camera. Update your system settings to proceed.";

/* Alert title */
"MISSING_CAMERA_PERMISSION_TITLE" = "Forsta needs to access your camera.";

/* No comment provided by engineer. */
"MSGVIEW_MISSED_CALL" = "สายที่ไม่ได้รับจาก %@";

/* No comment provided by engineer. */
"MSGVIEW_RECEIVED_CALL" = "คุณได้รับสายจาก %@";

/* No comment provided by engineer. */
"MSGVIEW_YOU_CALLED" = "คุณได้โทรหา %@";

/* No comment provided by engineer. */
"MULTIDEVICE_PAIRING_MAX_DESC" = "คุณไม่สามารถจับคู่อุปกรณ์ใด ๆ เพิ่มเติมได้อีก";

/* No comment provided by engineer. */
"MULTIDEVICE_PAIRING_MAX_RECOVERY" = "คุณได้มาถึงขีดจำกัดจำนวนอุปกรณ์สูงสุดที่คุณสามารถจับคู่กับบัญชีของคุณได้ในขณะนี้ โปรดเอาอุปกรณ์ออกหรือลองอีกครั้งเพื่อจับคู่ในภายหลัง";

/* No comment provided by engineer. */
"NETWORK_ERROR_RECOVERY" = "โปรดตรวจสอบว่าคุณกำลังออนไลน์และลองอีกครั้ง";

/* No comment provided by engineer. */
"NETWORK_STATUS_CONNECTED" = "เชื่อมต่อแล้ว";

/* No comment provided by engineer. */
"NETWORK_STATUS_CONNECTING" = "กำลังเชื่อมต่อ";

/* No comment provided by engineer. */
"NETWORK_STATUS_HEADER" = "สถานะเครือข่าย";

/* No comment provided by engineer. */
"NETWORK_STATUS_OFFLINE" = "ออฟไลน์";

/* No comment provided by engineer. */
"NETWORK_STATUS_TEXT" = "คุณสามารถตรวจสอบสถานะเครือข่ายของคุณโดยดูที่แถบสีด้านบนกล่องขาเข้าของคุณ";

/* No comment provided by engineer. */
"NEW_GROUP_DEFAULT_TITLE" = "กลุ่มใหม่";

/* No comment provided by engineer. */
"NEW_GROUP_NAMEGROUP_REQUEST_DEFAULT" = "ตั้งชื่อแชทกลุ่มนี้";

/* No comment provided by engineer. */
"NEW_GROUP_REQUEST_ADDPEOPLE" = "เพิ่มผู้คน";

/* No comment provided by engineer. */
"NOTIFICATION_SEND_FAILED" = "ไม่สามารถส่งข้อความของคุณไปยัง %@";

/* No comment provided by engineer. */
"NOTIFICATIONS_FOOTER_WARNING" = "เนื่องจากข้อบกพร่องที่ทราบใน Push framework ของ Apple ตัวอย่างข้อความจะแสดงเฉพาะเมื่อข้อความถูกดึงข้อมูลภายใน 30 วินาทีหลังจากส่ง ผลลัพธ์คือป้ายประกาศบนแอปพลิเคชันอาจไม่เที่ยงตรง";

/* No comment provided by engineer. */
"NOTIFICATIONS_NONE" = "ไม่มีชื่อหรือข้อความ";

/* No comment provided by engineer. */
"NOTIFICATIONS_SECTION_BACKGROUND" = "การแจ้งเตือนพื้นหลัง";

/* No comment provided by engineer. */
"NOTIFICATIONS_SECTION_INAPP" = "การแจ้งเตือนในแอป";

/* No comment provided by engineer. */
"NOTIFICATIONS_SENDER_AND_MESSAGE" = "ชื่อและข้อความของผู้ส่ง";

/* No comment provided by engineer. */
"NOTIFICATIONS_SENDER_ONLY" = "ชื่อผู้ส่งเท่านั้น";

/* No comment provided by engineer. */
"NOTIFICATIONS_SHOW" = "แสดง";

/* No comment provided by engineer. */
"NOTIFICATIONS_SOUND" = "เสียงการแจ้งเตือน";

/* No comment provided by engineer. */
"OK" = "ตกลง";

/* Button text which opens the settings app */
"OPEN_SETTINGS_BUTTON" = "การตั้งค่า";

/* Info Message when {{other user}} disables or doesn't support disappearing messages */
"OTHER_DISABLED_DISAPPEARING_MESSAGES_CONFIGURATION" = "%@ ได้ปิดใช้งานข้อความหายตัว";

/* Info Message when {{other user}} updates message expiration to {{time amount}}, see the *_TIME_AMOUNT strings for context. */
"OTHER_UPDATED_DISAPPEARING_MESSAGES_CONFIGURATION" = "%@ ได้ตั้งเวลาข้อความหายตัวเป็น %@";

/* No comment provided by engineer. */
"OUTGOING_CALL" = "สายโทรออก";

/* No comment provided by engineer. */
"PHONE_NEEDS_UNLOCK" = "iPhone ของคุณจำเป็นต้องปลดล็อคเพื่อรับข้อความใหม่";

/* Alert body when verifying with {{contact name}} */
"PRIVACY_VERIFICATION_FAILED_I_HAVE_WRONG_KEY_FOR_THEM" = "Those don't look like the safety numbers for %@. Are you verifying the correct contact?";

/* Alert body when verifying with {{contact name}} */
"PRIVACY_VERIFICATION_FAILED_THEY_HAVE_WRONG_KEY_FOR_ME" = "Every pair of Forsta users shares distinct safety numbers. Double check that %@ is displaying *your* distinct safety numbers.";

/* alert body */
"PRIVACY_VERIFICATION_FAILED_WITH_OLD_LOCAL_VERSION" = "คุณกำลังใช้ Forsta รุ่นเก่า คุณจำเป็นต้องอัปเดตก่อนที่คุณจะสามารถตรวจสอบ";

/* alert body */
"PRIVACY_VERIFICATION_FAILED_WITH_OLD_REMOTE_VERSION" = "คู่สนทนาของคุณกำลังใช้ Forsta รุ่นเก่า เขาจำเป็นต้องอัปเดตก่อนที่คุณจะสามารถตรวจสอบ";

/* alert body */
"PRIVACY_VERIFICATION_FAILURE_INVALID_QRCODE" = "รหัสที่สแกนดูไม่เหมือนกับรหัสตัวเลขความปลอดภัย คุณทั้งสองกำลังใช้ Forsta รุ่นล่าสุดอยู่หรือไม่?";

/* Paragraph(s) shown alongside keying material when verifying privacy with {{contact name}} */
"PRIVACY_VERIFICATION_INSTRUCTIONS" = "หากคุณต้องการตรวจสอบความปลอดภัยในการเข้ารหัสจากต้นทางถึงปลายทางของคุณกับ %@ เปรียบเทียบตัวเลขด้านบนกับตัวเลขบนอุปกรณ์ของเขา\n\nหรืออีกทางเลือก คุณสามารถสแกนรหัสบนโทรศัพท์ของเขา หรือขอให้เขาสแกนรหัสของคุณ";

/* Navbar title */
"PRIVACY_VERIFICATION_TITLE" = "ตรวจสอบตัวเลขความปลอดภัย";

/* No comment provided by engineer. */
"PROCEED_BUTTON" = "ดำเนินการต่อ";

/* No comment provided by engineer. */
"PUSH_MANAGER_MARKREAD" = "ทำเครื่องหมายเป็นอ่านแล้ว";

/* No comment provided by engineer. */
"PUSH_MANAGER_REPLY" = "ตอบกลับ";

/* Alert title */
"PUSH_REGISTER_SUCCESS" = "ลงทะเบียนใหม่สำหรับการแจ้งเตือนแบบผลักสำเร็จ";

/* Used in table section header and alert view title contexts */
"PUSH_REGISTER_TITLE" = "การแจ้งเตือนแบบผลัก";

/* No comment provided by engineer. */
"PUSH_SETTINGS_MESSAGE" = "Forsta ต้องการเปิดใช้งานการเตือนและเสียงการแจ้งเตือนแบบผลักเพื่อให้ทำงานได้ถูกต้อง โปรดเปลี่ยนค่าในแอป การตั้งค่า >> ศูนย์การแจ้งเตือน >> Forsta";

/* No comment provided by engineer. */
"QUESTIONMARK_PUNCTUATION" = "?";

/* No comment provided by engineer. */
"RATING_MSG" = "หากคุณเพลิดเพลินกับการใช้ Forsta เพื่อสนทนาแบบส่วนตัว คุณสามารถสนับสนุนโครงการของเราโดยการให้คะแนน ใช้เวลาไม่ถึงนาที และจะช่วยให้ผู้อื่นพบความเป็นส่วนตัว";

/* No comment provided by engineer. */
"RATING_RATE" = "ให้คะแนน Forsta";

/* No comment provided by engineer. */
"RATING_TITLE" = "สนับสนุน Forsta!";

/* No comment provided by engineer. */
"REGISTER_CC_ERR_ALERT_VIEW_MESSAGE" = "โปรดป้อนรหัสประเทศที่ถูกต้อง";

/* No comment provided by engineer. */
"REGISTER_CC_ERR_ALERT_VIEW_TITLE" = "ข้อผิดพลาดรหัสประเทศ";

/* No comment provided by engineer. */
"REGISTER_CONTACTS_BODY" = "Forsta ช่วยให้คุณสามารถสนทนาแบบส่วนตัวกับรายชื่อที่มีอยู่ของคุณ เพื่อใช้ Forsta โปรดอนุญาตให้เข้าถึงรายชื่อของคุณ";

/* No comment provided by engineer. */
"REGISTER_CONTACTS_CONTINUE" = "ดำเนินการต่อ";

/* No comment provided by engineer. */
"REGISTER_CONTACTS_WELCOME" = "ยินดีต้อนรับ!";

/* No comment provided by engineer. */
"REGISTER_FAILED_TRY_AGAIN" = "ลองอีกครั้ง";

/* No comment provided by engineer. */
"REGISTER_RATE_LIMITING_BODY" = "ขณะนี้เซิร์ฟเวอร์กำลังจำกัดอัตราการลงทะเบียน โปรดลองอีกครั้งในภายหลัง";

/* No comment provided by engineer. */
"REGISTERED_NUMBER_TEXT" = "Registered Number";

/* Alert title */
"REGISTRATION_BODY" = "ไม่สามารถลงทะเบียนใหม่สำหรับการแจ้งเตือนแบบผลัก";

/* No comment provided by engineer. */
"REGISTRATION_DEFAULT_COUNTRY_NAME" = "รหัสประเทศ";

/* No comment provided by engineer. */
"REGISTRATION_ENTERNUMBER_DEFAULT_TEXT" = "ป้อนหมายเลข";

/* No comment provided by engineer. */
"REGISTRATION_ERROR" = "ข้อผิดพลาดการลงทะเบียน";

/* alert body during registration */
"REGISTRATION_ERROR_BLANK_VERIFICATION_CODE" = "We can't activate your account until you verify the code we sent you.";

/* No comment provided by engineer. */
"REGISTRATION_NON_VALID_NUMBER" = "ไม่รองรับรูปแบบหมายเลขโทรศัพท์นี้ โปรดติดต่อฝ่ายสนับสนุน";

/* No comment provided by engineer. */
"REGISTRATION_PHONENUMBER_BUTTON" = "หมายเลขโทรศัพท์";

/* No comment provided by engineer. */
"REGISTRATION_RESTRICTED_MESSAGE" = "มีใครบางคนตื่นเต้นที่จะส่งข้อความแรกของเขา! คุณจำเป็นต้องลงทะเบียนก่อนที่จะกระทำสิ่งนี้ได้";

/* No comment provided by engineer. */
"REGISTRATION_TITLE_LABEL" = "หมายเลขโทรศัพท์ของคุณ";

/* Alert view title */
"REGISTRATION_VERIFICATION_FAILED_TITLE" = "Verification Failed";

/* Alert body, during registration */
"REGISTRATION_VERIFICATION_FAILED_WRONG_CODE_DESCRIPTION" = "The numbers you submitted don't match what we sent. Want to double check?";

/* No comment provided by engineer. */
"REGISTRATION_VERIFY_DEVICE" = "ตรวจสอบอุปกรณ์นี้";

/* No comment provided by engineer. */
"REJECT_CALL_BUTTON_TITLE" = "ปฏิเสธ";

/* No comment provided by engineer. */
"RELAY_REGISTERED_ERROR_RECOVERY" = "หมายเลขโทรศัพท์ที่คุณกำลังพยายามจะลงทะเบียนได้มีการลงทะเบียนอยู่แล้วบนเซิร์ฟเวอร์อื่น โปรดเลิกลงทะเบียนจากที่นั่นและลองอีกครั้ง";

/* No comment provided by engineer. */
"REREGISTER_FOR_PUSH" = "ลงทะเบียนใหม่สำหรับการแจ้งเตือนแบบผลัก";

/* Generic text for button that retries whatever the last action was. */
"RETRY_BUTTON_TEXT" = "ลองใหม่";

/* Snippet to share {{safety numbers}} with a friend. sent e.g. via sms */
"SAFETY_NUMBER_SHARE_FORMAT" = "Our Forsta Safety Numbers:\n%@";

/* Action sheet heading */
"SAFETY_NUMBERS_ACTIONSHEET_TITLE" = "ตัวเลขความปลอดภัยสำหรับ %@ มีการเปลี่ยนแปลง คุณอาจต้องการตรวจสอบ";

/* Button label presented with camera icon while verifying privacy credentials. Shows the camera interface. */
"SCAN_CODE_ACTION" = "สแกนรหัส";

/* label presented once scanning (camera) view is visible. */
"SCAN_CODE_INSTRUCTIONS" = "Scan the QR Code on your contact's device.";

/* No comment provided by engineer. */
"SEARCH_BYNAMEORNUMBER_PLACEHOLDER_TEXT" = "ค้นหาโดยชื่อหรือหมายเลข";

/* {{number of seconds}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 seconds}}'. See other *_TIME_AMOUNT strings */
"SECONDS_TIME_AMOUNT" = "%u วินาที";

/* No comment provided by engineer. */
"SECURE_SESSION_RESET" = "วาระแบบปลอดภัยถูกรีเซ็ต";

/* No comment provided by engineer. */
"SEND_AGAIN_BUTTON" = "ส่งอีกครั้ง";

/* No comment provided by engineer. */
"SEND_BUTTON_TITLE" = "ส่ง";

/* No comment provided by engineer. */
"SEND_SMS_BUTTON" = "ส่ง SMS ไปยัง: ";

/* No comment provided by engineer. */
"SEND_SMS_CONFIRM_TITLE" = "เชิญชวนเพื่อนผ่านทาง SMS ที่ไม่ปลอดภัย?";

/* No comment provided by engineer. */
"SEND_SMS_INVITE_FAILURE" = "การส่ง SMS ล้มเหลว โปรดลองอีกครั้งในภายหลัง";

/* No comment provided by engineer. */
"SEND_SMS_INVITE_SUCCESS" = "คุณได้เชิญชวนเพื่อนของคุณให้มาใช้ Forsta!";

/* No comment provided by engineer. */
"SEND_SMS_INVITE_TITLE" = "คุณต้องการเชิญชวนหมายเลขเหล่านี้มายัง Forsta หรือไม่:";

/* No comment provided by engineer. */
"SETTINGS_ABOUT" = "เกี่ยวกับ";

/* No comment provided by engineer. */
"SETTINGS_ADVANCED_DEBUGLOG" = "เปิดใช้งานบันทึกการดีบั๊ก";

/* No comment provided by engineer. */
"SETTINGS_ADVANCED_SUBMIT_DEBUGLOG" = "ส่งบันทึกการดีบั๊ก";

/* No comment provided by engineer. */
"SETTINGS_ADVANCED_TITLE" = "ขั้นสูง";

/* User settings section footer, a detailed explanation */
"SETTINGS_BLOCK_ON_IDENITY_CHANGE_DETAIL" = "Requires your approval before communicating with someone who has new safety numbers, commonly from a reinstall of Forsta.";

/* Table cell label */
"SETTINGS_BLOCK_ON_IDENTITY_CHANGE_TITLE" = "Require Approval on Change";

/* No comment provided by engineer. */
"SETTINGS_CLEAR_HISTORY" = "ล้างบันทึกประวัติ";

/* No comment provided by engineer. */
"SETTINGS_COPYRIGHT" = "สงวนลิขสิทธิ์ Open Whisper Systems\nสัญญาอนุญาตภายใต้ GPLv3";

/* No comment provided by engineer. */
"SETTINGS_DELETE_ACCOUNT_BUTTON" = "ลบบัญชี";

/* No comment provided by engineer. */
"SETTINGS_DELETE_HISTORYLOG_CONFIRMATION" = "คุณแน่ใจหรือไม่ว่าต้องการลบประวัติทั้งหมดของคุณ (ข้อความ, ไฟล์แนบ, ประวัติการโทร ...) ? การกระทำนี้ไม่สามารถย้อนคืนได้";

/* No comment provided by engineer. */
"SETTINGS_DELETE_HISTORYLOG_CONFIRMATION_BUTTON" = "ฉันแน่ใจ";

/* No comment provided by engineer. */
"SETTINGS_HELP_HEADER" = "ช่วยเหลือ";

/* Section header */
"SETTINGS_HISTORYLOG_TITLE" = "บันทึกประวัติ";

/* No comment provided by engineer. */
"SETTINGS_INFORMATION_HEADER" = "ข้อมูล";

/* No comment provided by engineer. */
"SETTINGS_INVITE_HEADER" = "เชิญชวน";

/* No comment provided by engineer. */
"SETTINGS_INVITE_TWITTER_TEXT" = "คุณสามารถเข้าถึงฉันโดยใช้ Forsta จาก @forstainc รับเลยตอนนี้";

/* Title for settings activity */
"SETTINGS_NAV_BAR_TITLE" = "การตั้งค่า";

/* No comment provided by engineer. */
"SETTINGS_NOTIFICATIONS" = "การแจ้งเตือน";

/* No comment provided by engineer. */
"SETTINGS_PRIVACY_TITLE" = "ความเป็นส่วนตัว";

/* Section header */
"SETTINGS_PRIVACY_VERIFICATION_TITLE" = "การอนุมัติตัวเลขความปลอดภัย";

/* No comment provided by engineer. */
"SETTINGS_SCREEN_SECURITY" = "เปิดใช้งานความปลอดภัยหน้าจอ";

/* No comment provided by engineer. */
"SETTINGS_SCREEN_SECURITY_DETAIL" = "ป้องกัน Forsta จากการแสดงตัวอย่างในหน้าสลับแอป";

/* Section header */
"SETTINGS_SECURITY_TITLE" = "ความปลอดภัยหน้าจอ";

/* No comment provided by engineer. */
"SETTINGS_SHARE_INSTALL" = "แบ่งปันลิงก์สำหรับติดตั้ง";

/* No comment provided by engineer. */
"SETTINGS_SUPPORT" = "สนับสนุน";

/* No comment provided by engineer. */
"SETTINGS_VERSION" = "รุ่น";

/* Action sheet item */
"SHOW_SAFETY_NUMBER_ACTION" = "แสดงตัวเลขความปลอดภัยใหม่";

/* {{1 day}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{1 day}}'. See other *_TIME_AMOUNT strings */
"SINGLE_DAY_TIME_AMOUNT" = "%u วัน";

/* {{1 hour}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{1 hour}}'. See other *_TIME_AMOUNT strings */
"SINGLE_HOUR_TIME_AMOUNT" = "%u ชั่วโมง";

/* {{1 minute}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{1 minute}}'. See other *_TIME_AMOUNT strings */
"SINGLE_MINUTE_TIME_AMOUNT" = "%u นาที";

/* {{1 week}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{1 week}}'. See other *_TIME_AMOUNT strings */
"SINGLE_WEEK_TIME_AMOUNT" = "%u สัปดาห์";

/* No comment provided by engineer. */
"SMS_INVITE_BODY" = "ฉันกำลังเชิญชวนให้คุณติดตั้ง Forsta! นี่คือลิงก์:";

/* Alert body after verifying privacy with {{other user's name}} */
"SUCCESSFUL_VERIFICATION_DESCRIPTION" = "ตรวจสอบตัวเลขความปลอดภัยของคุณแล้ว คุณสามารถมั่นใจได้ว่าการสนทนาของคุณกับ %@ เป็นส่วนตัว";

/* No comment provided by engineer. */
"SUCCESSFUL_VERIFICATION_TITLE" = "ตรวจสอบตัวเลขความปลอดภัยแล้ว!";

/* No comment provided by engineer. */
"TAKE_MEDIA_BUTTON" = "ถ่ายภาพหรือวิดีโอ";

/* No comment provided by engineer. */
"TAKE_PICTURE_BUTTON" = "ถ่ายรูป";

/* No comment provided by engineer. */
"TIMEOUT_CONTACTS_DETAIL" = "เราไม่สามารถดึงข้อมูลรายชื่อที่อัปเดตจากเซิร์ฟเวอร์ โปรดลองอีกครั้งในภายหลัง";

/* No comment provided by engineer. */
"TXT_CANCEL_TITLE" = "ยกเลิก";

/* No comment provided by engineer. */
"TXT_DELETE_TITLE" = "ลบ";

/* Pressing this button moves an archived thread from the archive back to the inbox */
"UNARCHIVE_ACTION" = "เลิกเก็บถาวร";

/* In Inbox view, last message label for thread with corrupted attachment. */
"UNKNOWN_ATTACHMENT_LABEL" = "ไฟล์แนบที่ไม่รู้จัก";

/* Displayed if for some reason we can't determine a contacts phone number *or* name */
"UNKNOWN_CONTACT_NAME" = "รายชื่อที่ไม่รู้จัก";

/* button title for unlinking a device */
"UNLINK_ACTION" = "เลิกเชื่อมโยง";

/* Alert message to confirm unlinking a device */
"UNLINK_CONFIRMATION_ALERT_BODY" = "เมื่อเลิกเชื่อมโยงอุปกรณ์นี้ อุปกรณ์จะไม่สามารถส่งหรือรับข้อความได้อีกต่อไป";

/* Alert title for confirming device deletion */
"UNLINK_CONFIRMATION_ALERT_TITLE" = "เลิกเชื่อมโยง \"%@\"?";

/* Alert title when unlinking device fails */
"UNLINKING_FAILED_ALERT_TITLE" = "Forsta ไม่สามารถเลิกเชื่อมโยงอุปกรณ์ของคุณ";

/* Label text in device manager for a device with no name */
"UNNAMED_DEVICE" = "อุปกรณ์ที่ไม่มีชื่อ";

/* No comment provided by engineer. */
"UNREGISTER_SIGNAL_FAIL" = "ไม่สามารถเลิกลงทะเบียนจาก Forsta";

/* No comment provided by engineer. */
"UNSUPPORTED_ATTACHMENT" = "ได้รับชนิดไฟล์แนบที่ไม่รองรับ";

/* No comment provided by engineer. */
"UNSUPPORTED_FEATURE_ERROR" = "อุปกรณ์ของคุณไม่รองรับคุณลักษณะนี้";

/* No comment provided by engineer. */
"UPDATE_BUTTON_TITLE" = "อัปเดต";

/* No comment provided by engineer. */
"Upgrading Forsta ..." = "กำลังอัปเกรด Forsta ...";

/* message footer while attachment is uploading */
"UPLOADING_MESSAGE_TEXT" = "กำลังอัปโหลด...";

/* button text during registration to make corrections to your submitted phone number */
"VERIFICATION_CHALLENGE_CHANGE_NUMBER" = "เปลี่ยนหมายเลข";

/* Text field placeholder for SMS verification code during registration */
"VERIFICATION_CHALLENGE_DEFAULT_TEXT" = "รหัสตรวจสอบ";

/* button text during registration to request phone number verification be done via phone call */
"VERIFICATION_CHALLENGE_SEND_VIAVOICE" = "โทรหาฉันแทน";

/* button text during registration to request another SMS code be sent */
"VERIFICATION_CHALLENGE_SUBMIT_AGAIN" = "ขอรหัสอีกครั้ง";

/* button text during registration to submit your SMS verification code */
"VERIFICATION_CHALLENGE_SUBMIT_CODE" = "ส่งรหัสตรวจสอบ";

/* Navigation title in the registration flow - during the sms code verification process. */
"VERIFICATION_HEADER" = "ตรวจสอบ";

/* table cell label in conversation settings */
"VERIFY_PRIVACY" = "ตรวจสอบตัวเลขความปลอดภัย";

/* Activity indicator title, shown upon returning to the device manager, until you complete the provisioning process on desktop */
"WAITING_TO_COMPLETE_DEVICE_LINK_TEXT" = "ตั้งค่าให้เสร็จสมบูรณ์บน Forsta Desktop";

/* {{number of weeks}}, embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 weeks}}'. See other *_TIME_AMOUNT strings */
"WEEKS_TIME_AMOUNT" = "%u สัปดาห์";

/* No comment provided by engineer. */
"WHISPER_NAV_BAR_TITLE" = "กล่องขาเข้า";

/* Info Message when you disable disappearing messages */
"YOU_DISABLED_DISAPPEARING_MESSAGES_CONFIGURATION" = "คุณได้ปิดใช้งานข้อความหายตัว";

/* Info message embedding a {{time amount}}, see the *_TIME_AMOUNT strings for context. */
"YOU_UPDATED_DISAPPEARING_MESSAGES_CONFIGURATION" = "คุณได้ตั้งเวลาข้อความหายตัวเป็น %@";
